app/views/recipes/_form.html.erb

  <fieldset class="form-group">
    <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name) do |b| %>
---
SELECT "categories".* FROM "categories"