app/views/recipes/show.html.erb

  <strong>User:</strong>
    <h1><%= @recipe.user.first_name %> <%= @recipe.user.last_name %></h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]