app/controllers/messages_controller.rb

SELECT  "messages".* FROM "messages" WHERE "messages"."conversation_id" = $1 ORDER BY "messages"."id" DESC LIMIT $2  [["conversation_id", 1], ["LIMIT", 1]]
UPDATE "messages" SET "read" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["read", true], ["updated_at", 2016-08-09 11:25:07 UTC], ["id", 1]]
---
  def index
      @messages = @conversation.messages

      if @messages.last && @messages.last.user_id != current_user.id
        @messages.last.update(read: true)

INSERT INTO "messages" ("body", "conversation_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Hello Bob,how r u ?"], ["conversation_id", 3], ["user_id", 3], ["created_at", 2016-08-09 10:59:27 UTC], ["updated_at", 2016-08-09 10:59:27 UTC]]
---
    def create
      @message = @conversation.messages.new(message_params)
      @message.user = current_user

      if @message.save