app/controllers/users_controller.rb

UPDATE "users" SET "last_name" = $1, "username" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["last_name", "Barrot"], ["username", "Chetan Barrot"], ["updated_at", 2016-08-10 09:00:00 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)